CSI API ETABS v1
cAreaObj.GetLoadWindPressure Method
 Retrieves the wind pressure load assignments to area objects.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetLoadWindPressure(
	string Name,
	ref int NumberItems,
	ref string[] AreaName,
	ref string[] LoadPat,
	ref int[] MyType,
	ref double[] Cp,
	eItemType ItemType = eItemType.Objects
)
Function GetLoadWindPressure (
	Name As String,
	ByRef NumberItems As Integer,
	ByRef AreaName As String(),
	ByRef LoadPat As String(),
	ByRef MyType As Integer(),
	ByRef Cp As Double(),
	Optional ItemType As eItemType = eItemType.Objects
) As Integer
Dim instance As cAreaObj
Dim Name As String
Dim NumberItems As Integer
Dim AreaName As String()
Dim LoadPat As String()
Dim MyType As Integer()
Dim Cp As Double()
Dim ItemType As eItemType
Dim returnValue As Integer
returnValue = instance.GetLoadWindPressure(Name,
	NumberItems, AreaName, LoadPat, MyType,
	Cp, ItemType)
int GetLoadWindPressure(
	String^ Name,
	int% NumberItems,
	array<String^>^% AreaName,
	array<String^>^% LoadPat,
	array<int>^% MyType,
	array<double>^% Cp,
	eItemType ItemType = eItemType::Objects
)
abstract GetLoadWindPressure :
        Name : string *
        NumberItems : int byref *
        AreaName : string[] byref *
        LoadPat : string[] byref *
        MyType : int[] byref *
        Cp : float[] byref *
        ?ItemType : eItemType
(* Defaults:
        let _ItemType = defaultArg ItemType eItemType.Objects
*)
-> int
Parameters
Name
Type: System.String
 The name of an existing area object or group, depending on the value of the ItemType item.
NumberItems
Type: System.Int32
 The total number of wind pressure loads retrieved for the specified area objects.
AreaName
Type: System.String[]
 This is an array that includes the name of the area object associated with each wind pressure load.
LoadPat
Type: System.String[]
 This is an array that includes the name of the load pattern associated with each wind pressure load.
MyType
Type: System.Int32[]
 This is an array that includes either 1 or 2, indicating the wind pressure type.
Windward, pressure varies over height
Other, pressure is constant over height
Cp
Type: System.Double[]
 This is an array that includes the wind pressure coefficient value.
ItemType (Optional)
Type: ETABSv1.eItemType
 This is one of the following items in the eItemType enumeration:
Object = 0
Group = 1
SelectedObjects = 2
 If this item is Objects, the assignments are retrieved for the area object specified by the Name item.
 If this item is Group, the assignments are retrieved for all area objects in the group specified by the Name item.
 If this item is SelectedObjects, assignments are retrieved for is made to all selected area objects, and the Name item is ignored.
Return Value
Type: Int32
 Returns zero if the load assignments are successfully retrieved; it returns a nonzero value.
Remarks
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace